In [3]:
import pandas as pd

In [4]:
salaries = [
	("Mark", 1000, 23),
	("John", 1500, 25),
	("Daniel", 2300, 38),
	("Greg", 5000, 42)
]
salaries

[('Mark', 1000, 23),
 ('John', 1500, 25),
 ('Daniel', 2300, 38),
 ('Greg', 5000, 42)]

In [5]:
df = pd.DataFrame(salaries)
df

        0     1   2
0    Mark  1000  23
1    John  1500  25
2  Daniel  2300  38
3    Greg  5000  42

In [6]:
df = pd.DataFrame(salaries, columns=["name", "salary", "age"])
df = df.set_index("name")
df

        salary  age
name
Mark      1000   23
John      1500   25
Daniel    2300   38
Greg      5000   42

In [7]:
df.describe()

            salary        age
count     4.000000   4.000000
mean   2450.000000  32.000000
std    1782.320585   9.416298
min    1000.000000  23.000000
25%    1375.000000  24.500000
50%    1900.000000  31.500000
75%    2975.000000  39.000000
max    5000.000000  42.000000

In [9]:
salary_increased_series = df['salary'].apply(lambda salary: salary + 2000)
df['salary'] = salary_increased_series
df

        salary  age
name
Mark      5000   23
John      5500   25
Daniel    6300   38
Greg      9000   42

In [10]:
salary_raise = [2000, 2000, 2000, 2000]
df['salary'] + salary_raise
df

        salary  age
name
Mark      5000   23
John      5500   25
Daniel    6300   38
Greg      9000   42